In [1]:
import json
import pandas as pd
import numpy as np
import seaborn as sns
from scipy import stats


import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
basics = pd.read_csv("title_basics_cleaned (1) (2).csv.gz", low_memory=False)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

Movie ID (tconst)
Primary Title
Start Year
Runtime (in Minutes)
Genres

In [3]:
basics1= basics.drop(['titleType','originalTitle','isAdult','endYear'], axis=1)
basics1.head()

,tconst,primaryTitle,startYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama
3,tt0088751,The Naked Monster,2005.0,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,Crime and Punishment,2002.0,126,Drama

In [4]:
ratings = pd.read_csv("title_ratings_cleaned.csv.gz", low_memory=False)
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1986
1  tt0000002            5.8       265
2  tt0000005            6.2      2627
3  tt0000006            5.1       182
4  tt0000007            5.4       820

The TMDB API Results (multiple files)
Movie ID
Revenue
Budget
Certification (MPAA Rating)

In [6]:
tmdb = pd.read_csv("tmdb_results_combined.csv.gz", low_memory=False)
tmdb.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.1,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.0,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,"{'id': 1131062, 'name': 'Wong Kar-Wai’s Love T...",150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.1,2252.0,PG

Movie ID
Revenue
Budget
Certification (MPAA Rating)

In [10]:
tmdb_data=tmdb[['imdb_id','revenue','budget','certification']]
tmdb_data.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  14204632.0    150000.0            PG

## Required Transformation Steps for Title Basics:
title_genres: with the columns:

tconst
genre_id

genres:

genre_id
genre_name

In [11]:
basics1.head()

,tconst,primaryTitle,startYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama
3,tt0088751,The Naked Monster,2005.0,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,Crime and Punishment,2002.0,126,Drama

Normalize Genre:

Convert the single string of genres from title basics into 2 new tables.
1. title_genres: with the columns:

    tconst
     genre_id
2.genres:

genre_id
genre_name

In [37]:
## create a col with a list of genres
basics1['genres_split'] = basics1['genres'].str.split(',')
basics1

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama,[Drama]
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama,[Drama]
3,tt0088751,The Naked Monster,2005.0,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,Crime and Punishment,2002.0,126,Drama,[Drama]
...,...,...,...,...,...,...
86937,tt9914942,Life Without Sara Amat,2019.0,74,Drama,[Drama]
86938,tt9915872,The Last White Witch,2019.0,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
86939,tt9916170,The Rehearsal,2019.0,51,Drama,[Drama]
86940,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
86941,tt9916362,Coven,2020.0,92,"Drama,History","[Drama, History]"

using.explode() to separate the list of genres into new rows: one row for each genre a movie belonged to.

In [38]:
exploded_genres = basics1.explode('genres_split')
exploded_genres

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama,Drama
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama,Drama
...,...,...,...,...,...,...
86940,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Action
86940,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Adventure
86940,tt9916190,Safeguard,2020.0,95,"Action,Adventure,Thriller",Thriller
86941,tt9916362,Coven,2020.0,92,"Drama,History",Drama
86941,tt9916362,Coven,2020.0,92,"Drama,History",History

In [39]:
## Save just tconst and genres_split as new df
genres = exploded_genres[['tconst','genres_split']].copy()
genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

Finally, use .unique() to get the unique genres from the genres_split column

In [40]:
unique_genres = sorted(genres['genres_split'].unique())

2. Create a new title_genres table

create a new title_genres from the exploded df.

In [41]:
# title_genres=exploded_genres[['tconst','genres_split']].copy()
# title_genres.head()
#table no 1

3. Create a genre mapper dictionary to replace string genres with integers

In [42]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [43]:
## Use .map or .replace with our genre_id_map dictionary
genres['Genre_ID'] = genres['genres_split'].replace(genre_map)

## Drop the original genre column
genres.drop(columns=['genres_split'],inplace=True)
genres

          tconst  Genre_ID
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0062336         7
2      tt0069049         7
...          ...       ...
86940  tt9916190         0
86940  tt9916190         2
86940  tt9916190        22
86941  tt9916362         7
86941  tt9916362        11

[162490 rows x 2 columns]

In [45]:
title_genres=genres[['tconst','Genre_ID']]
title_genres

          tconst  Genre_ID
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0062336         7
2      tt0069049         7
...          ...       ...
86940  tt9916190         0
86940  tt9916190         2
86940  tt9916190        22
86941  tt9916362         7
86941  tt9916362        11

[162490 rows x 2 columns]

4. Replace the string genres in title_genres with the new integer ids.

In [16]:
# ## make new integer genre_id and drop string genres
# exploded_genres['genre_id'] = exploded_genres['genres_split'].map(genre_map)
# exploded_genres = exploded_genres.drop(columns='genres_split')

5. Convert the genre map dictionary into a dataframe.

table no 2

In [59]:
genres=pd.DataFrame({'Genre_Name':genre_map.keys(),'Genre_id':genre_map.values()})
genres.head()

  Genre_Name  Genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [47]:
 titlebasics = basics1.drop(columns=['genres','genres_split'],axis=1)

In [48]:
titlebasics

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126
...,...,...,...,...
86937,tt9914942,Life Without Sara Amat,2019.0,74
86938,tt9915872,The Last White Witch,2019.0,97
86939,tt9916170,The Rehearsal,2019.0,51
86940,tt9916190,Safeguard,2020.0,95
86941,tt9916362,Coven,2020.0,92

find the maximum string length of tconst primary key column

In [22]:
# ## get max string length
# max_str_len = exploded_genres ['tconst'].fillna('').map(len).max()

In [23]:
# max_str_len

In [69]:
## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = titlebasics['tconst'].fillna('').map(len).max()
title_len = titlebasics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [70]:
from sqlalchemy import create_engine

In [71]:
username = "root"
password = "root" 
db_name = "movies"
connection_str = f"mysql+pymysql://{username}:{password}@localhost/movies"

In [72]:
## Check if database exists, if not, create it
if database_exists(connection_str) == False: 
    create_database(connection_str)
else: 
    print('The database already exists.')

The database already exists.

In [73]:
## creating connection to database "
engine = create_engine(connection_str)

In [74]:
titlebasics = titlebasics.loc[titlebasics['tconst']!='0']

In [75]:
# Save to sql with dtype and index=False
titlebasics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

86942

In [56]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [76]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,if_exists='replace',index=False)

162490

In [81]:
## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = genres['Genre_Name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema1 = {"Genre_id": Integer(), 
    }

In [82]:
genres.to_sql('genres',engine,dtype=df_schema1,if_exists='replace',index=False)

25

In [83]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_id`);')

In [92]:
## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = ratings['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema2 = { 
    "tconst": String(key_len+1),
    'averageRating':Float(),
    'numVotes':Integer()}

In [93]:
ratings.to_sql('title_ratings',engine,dtype=df_schema2,if_exists='replace',index=False)

503198

In [94]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [95]:
## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = tmdb_data['imdb_id'].fillna('').map(len).max()
title_len = tmdb_data['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema1 = {
    "imdb_id": String(key_len+1), 
    "certification": Text(title_len+1),
    'revenue':Float(),
    'budget':Float()}

In [96]:
tmdb_data.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  14204632.0    150000.0            PG

In [97]:
tmdb_data= tmdb_data.loc[ tmdb_data['imdb_id']!='0']

In [98]:
tmdb_data.head()

     imdb_id     revenue      budget certification
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  14204632.0    150000.0            PG
5  tt0118852         0.0         0.0             R

In [102]:
## Keeping some columns
#cols_to_keep = ['imdb_id','budget','revenue','certification']
tmdb_data = tmdb_data[['imdb_id','budget','revenue','certification']]
tmdb_data

        imdb_id      budget     revenue certification
1     tt0113026  10000000.0         0.0           NaN
2     tt0113092         0.0         0.0           NaN
3     tt0116391         0.0         0.0           NaN
4     tt0118694    150000.0  14204632.0            PG
5     tt0118852         0.0         0.0             R
...         ...         ...         ...           ...
2589  tt7797790         0.0         0.0           NaN
2590  tt8665056         0.0         0.0           NaN
2591  tt8795764         0.0         0.0            NR
2592  tt9071078         0.0         0.0           NaN
2593  tt9212730         0.0         0.0           NaN

[2592 rows x 4 columns]

In [103]:
## saving text length
key_len = tmdb_data['imdb_id'].map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()
key_len, cert_len

(10, 7)

In [104]:
## saving schema
tmdb_data_schema = {'imdb_id':String(key_len+1), 
                 'budget':Float(),
                   'revenue':Float(),
                 'certification':Text(cert_len+1)
                  }
tmdb_data_schema

{'imdb_id': String(length=11),
 'budget': Float(),
 'revenue': Float(),
 'certification': Text(length=8)}

In [105]:
tmdb_data.to_sql('tmdb_data',engine,if_exists='replace',dtype=tmdb_data_schema, index=False)

2592

In [106]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [107]:
## checking if tables created
q= '''SELECT * FROM genres
LIMIT 5;'''
pd.read_sql(q,engine)

  Genre_Name  Genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [108]:
## checking if tables created
q= '''SELECT * FROM titlebasics
LIMIT 5;'''
pd.read_sql(q,engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0035423,Kate & Leopold,2001.0,118
2,tt0035423,Kate & Leopold,2001.0,118
3,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
4,tt0069049,The Other Side of the Wind,2018.0,122

In [109]:
## checking if tables created
q= '''SELECT * FROM title_genres
LIMIT 5;'''
pd.read_sql(q,engine)

      tconst  Genre_ID
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [110]:
## checking if tables created
q= '''SELECT * FROM title_ratings
LIMIT 5;'''
pd.read_sql(q,engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1986
1  tt0000002            5.8       265
2  tt0000005            6.2      2627
3  tt0000006            5.1       182
4  tt0000007            5.4       820

In [112]:
## checking if tables created
q= '''SELECT * FROM tmdb_data 
LIMIT 5;'''
pd.read_sql(q,engine)

     imdb_id      budget     revenue certification
0  tt0035423  48000000.0  76019000.0         PG-13
1  tt0113026  10000000.0         0.0          None
2  tt0113092         0.0         0.0          None
3  tt0114447         0.0         0.0          None
4  tt0116391         0.0         0.0          None